In [2]:
import pandas as pd
import numpy as np
data=pd.Series(np.random.randn(9),index=[['a','a','a','b','b','c','c','d','d'],
                                          [ 1,2,3,1,3,1,2,2,3]])
data

a  1    0.870372
   2    0.577713
   3   -0.840510
b  1    0.360081
   3   -1.533445
c  1    1.057373
   2    2.277452
d  2   -0.204553
   3    0.277423
dtype: float64

In [3]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [5]:
data['b':'c']

b  1    0.360081
   3   -1.533445
c  1    1.057373
   2    2.277452
dtype: float64

In [7]:
data.iloc[5:7]

c  1    1.057373
   2    2.277452
dtype: float64

In [8]:
data[:,2]

a    0.577713
c    2.277452
d   -0.204553
dtype: float64

In [9]:
data.loc[['b','d']]

b  1    0.360081
   3   -1.533445
d  2   -0.204553
   3    0.277423
dtype: float64

In [10]:
x=pd.DataFrame(np.arange(12).reshape(4,3),index=[['a','a','b','b'],
                                    [ 1,2,1,2]],columns=[['ohio','colorado','ohio'],
                                                          ['green','red','green']])
x

     ohio colorado  ohio
    green      red green
a 1     0        1     2
  2     3        4     5
b 1     6        7     8
  2     9       10    11

In [13]:
x.index.names=['key1','key2']
x

           ohio colorado  ohio
          green      red green
key1 key2
a    1        0        1     2
     2        3        4     5
b    1        6        7     8
     2        9       10    11

In [14]:
x.columns.names=['state','colour']
x

state      ohio colorado  ohio
colour    green      red green
key1 key2
a    1        0        1     2
     2        3        4     5
b    1        6        7     8
     2        9       10    11